technoblogy/ulisp-msp430/ulisp-msp430.ino
object *tf_or (object *args, object *env) {
  while (args != NULL) {
    if (eval(car(args), env) != NULL) return car(args);
    args = cdr(args);
  }
  return nil;
}

// Core functions

object *fn_not (object *args, object *env) {
  (void) env;
  return (first(args) == nil) ? tee : nil;
}

object *fn_cons (object *args, object *env) {
  (void) env;
  return cons(first(args), second(args));
}

object *fn_atom (object *args, object *env) {
  (void) env;
  return atom(first(args)) ? tee : nil;
}

object *fn_listp (object *args, object *env) {
  (void) env;
  return listp(first(args)) ? tee : nil;
}

object *fn_consp (object *args, object *env) {
  (void) env;
  return consp(first(args)) ? tee : nil;
}

object *fn_symbolp (object *args, object *env) {
  (void) env;
  object *arg = first(args);
  return symbolp(arg) ? tee : nil;
}

object *fn_streamp (object *args, object *env) {
  (void) env;
  object *arg = first(args);
  return streamp(arg) ? tee : nil;
}

object *fn_eq (object *args, object *env) {
  (void) env;
  return eq(first(args), second(args)) ? tee : nil;
}

// List functions

object *fn_car (object *args, object *env) {
  (void) env;
  return carx(first(args));
}

object *fn_cdr (object *args, object *env) {
  (void) env;
  return cdrx(first(args));
}

object *fn_caar (object *args, object *env) {
  (void) env;
  return carx(carx(first(args)));
}

object *fn_cadr (object *args, object *env) {
  (void) env;
  return carx(cdrx(first(args)));
}

object *fn_cdar (object *args, object *env) {
  (void) env;
  return cdrx(carx(first(args)));
}

object *fn_cddr (object *args, object *env) {
  (void) env;
  return cdrx(cdrx(first(args)));
}

object *fn_caaar (object *args, object *env) {
  (void) env;
  return carx(carx(carx(first(args))));
}

object *fn_caadr (object *args, object *env) {
  (void) env;
  return carx(carx(cdrx(first(args))));
}

object *fn_cadar (object *args, object *env) {
  (void) env;
  return carx(cdrx(carx(first(args))));
}

object *fn_caddr (object *args, object *env) {
  (void) env;
  return carx(cdrx(cdrx(first(args))));
}

object *fn_cdaar (object *args, object *env) {
  (void) env;
  return cdrx(carx(carx(first(args))));
}

object *fn_cdadr (object *args, object *env) {
  (void) env;
  return cdrx(carx(cdrx(first(args))));
}

object *fn_cddar (object *args, object *env) {
  (void) env;
  return cdrx(cdrx(carx(first(args))));
}

object *fn_cdddr (object *args, object *env) {
  (void) env;
  return cdrx(cdrx(cdrx(first(args))));
}

object *fn_length (object *args, object *env) {
  (void) env;
  object *arg = first(args);
  if (listp(arg)) return number(listlength(arg));
  if (!stringp(arg)) error3(LENGTH, PSTR("argument is not a list or string"));
  return number(stringlength(arg));
}

object *fn_list (object *args, object *env) {
  (void) env;
  return args;
}

object *fn_reverse (object *args, object *env) {
  (void) env;
  object *list = first(args);
  object *result = NULL;
  while (list != NULL) {
    if (improperp(list)) error3(REVERSE, PSTR("argument is not a proper list"));
    push(first(list),result);
    list = cdr(list);
  }
  return result;
}

object *fn_nth (object *args, object *env) {
  (void) env;
  int n = integer(first(args));
  object *list = second(args);
  while (list != NULL) {
    if (improperp(list)) error3(NTH, PSTR("argument is not a proper list"));
    if (n == 0) return car(list);
    list = cdr(list);
    n--;
  }
  return nil;
}

object *fn_assoc (object *args, object *env) {
  (void) env;
  object *key = first(args);
  object *list = second(args);
  if (!listp(list)) error3(ASSOC, PSTR("second argument is not a list"));
  return assoc(key,list);
}

object *fn_member (object *args, object *env) {
  (void) env;
  object *item = first(args);
  object *list = second(args);
  while (list != NULL) {
    if (improperp(list)) error3(MEMBER, PSTR("argument is not a proper list"));
    if (eq(item,car(list))) return list;
    list = cdr(list);
  }
  return nil;
}

object *fn_apply (object *args, object *env) {
  object *previous = NULL;
  object *last = args;
  while (cdr(last) != NULL) {
    previous = last;
    last = cdr(last);
  }
  if (!listp(car(last))) error3(APPLY, PSTR("last argument is not a list"));
  cdr(previous) = car(last);
  return apply(first(args), cdr(args), &env);
}

object *fn_funcall (object *args, object *env) {
  return apply(first(args), cdr(args), &env);
}

object *fn_append (object *args, object *env) {
  (void) env;
  object *head = NULL;
  object *tail = NULL;
  while (args != NULL) {   
    object *list = first(args);
    while ((unsigned int)list >= PAIR) {
      object *obj = cons(car(list), cdr(list));
      if (head == NULL) head = obj;
      else cdr(tail) = obj;
      tail = obj;
      list = cdr(list);
    }
    if (cdr(args) != NULL && list != NULL) error3(APPEND, PSTR("argument is not a proper list"));
    args = cdr(args);
  }
  return head;
}

object *fn_mapc (object *args, object *env) {
  symbol_t name = MAPC;
  object *function = first(args);
  object *list1 = second(args);
  object *result = list1;
  object *list2 = cddr(args);
  if (list2 != NULL) {
    list2 = car(list2);
    while (list1 != NULL && list2 != NULL) {
      if (improperp(list1)) error3(name, PSTR("second argument is not a proper list"));
      if (improperp(list2)) error3(name, PSTR("third argument is not a proper list"));
      apply(function, cons(car(list1),cons(car(list2),NULL)), &env);
      list1 = cdr(list1); list2 = cdr(list2);
    }
  } else {
    while (list1 != NULL) {
      if (improperp(list1)) error3(name, PSTR("second argument is not a proper list"));
      apply(function, cons(car(list1),NULL), &env);
      list1 = cdr(list1);
    }
  }
  return result;
}

object *fn_mapcar (object *args, object *env) {
  symbol_t name = MAPCAR;
  object *function = first(args);
  object *list1 = second(args);
  object *list2 = cddr(args);
  object *head = cons(NULL, NULL);
  push(head,GCStack);
  object *tail = head;
  if (list2 != NULL) {
    list2 = car(list2);
    while (list1 != NULL && list2 != NULL) {
      if (improperp(list1)) error3(name, PSTR("second argument is not a proper list"));
      if (improperp(list2)) error3(name, PSTR("third argument is not a proper list"));
      object *result = apply(function, cons(car(list1), cons(car(list2),NULL)), &env);
      object *obj = cons(result,NULL);
      cdr(tail) = obj;
      tail = obj;
      list1 = cdr(list1); list2 = cdr(list2);
    }
  } else if (list1 != NULL) {
    while (list1 != NULL) {
      if (improperp(list1)) error3(name, PSTR("second argument is not a proper list"));
      object *result = apply(function, cons(car(list1),NULL), &env);
      object *obj = cons(result,NULL);
      cdr(tail) = obj;
      tail = obj;
      list1 = cdr(list1);
    }
  }
  pop(GCStack);
  return cdr(head);
}

