technoblogy/ulisp-msp430/ulisp-msp430.ino
object *fn_edit (object *args, object *env) {
  object *fun = first(args);
  object *pair = findvalue(fun, env);
  clrflag(EXITEDITOR);
  object *arg = edit(eval(fun, env));
  cdr(pair) = arg;
  return arg;
}

object *edit (object *fun) {
  while (1) {
    if (tstflag(EXITEDITOR)) return fun;
    char c = gserial();
    if (c == 'q') setflag(EXITEDITOR);
    else if (c == 'b') return fun;
    else if (c == 'r') fun = read(gserial);
    else if (c == '\n') { pfl(pserial); superprint(fun, 0, pserial); pln(pserial); }
    else if (c == 'c') fun = cons(read(gserial), fun);
    else if (atom(fun)) pserial('!');
    else if (c == 'd') fun = cons(car(fun), edit(cdr(fun)));
    else if (c == 'a') fun = cons(edit(car(fun)), cdr(fun));
    else if (c == 'x') fun = cdr(fun);
    else pserial('?');
  }
}

// Pretty printer

const int PPINDENT = 2;
const int PPWIDTH = 80;

void pcount (char c) {
  LastPrint = c;
  if (c == '\n') GlobalStringIndex++;
  GlobalStringIndex++;
}
  
int atomwidth (object *obj) {
  GlobalStringIndex = 0;
  printobject(obj, pcount);
  return GlobalStringIndex;
}

boolean quoted (object *obj) {
  return (consp(obj) && car(obj) != NULL && car(obj)->name == QUOTE && consp(cdr(obj)) && cddr(obj) == NULL);
}

int subwidth (object *obj, int w) {
  if (atom(obj)) return w - atomwidth(obj);
  if (quoted(obj)) return subwidthlist(car(cdr(obj)), w - 1);
  return subwidthlist(obj, w - 1);
}

int subwidthlist (object *form, int w) {
  while (form != NULL && w >= 0) {
    if (atom(form)) return w - (2 + atomwidth(form));
    w = subwidth(car(form), w - 1);
    form = cdr(form);
  }
  return w;
}

void superprint (object *form, int lm, pfun_t pfun) {
  if (atom(form)) {
    if (symbolp(form) && form->name == NOTHING) pstring(name(form), pfun);
    else printobject(form, pfun);
  }
  else if (quoted(form)) { pfun('\''); superprint(car(cdr(form)), lm + 1, pfun); }
  else if (subwidth(form, PPWIDTH - lm) >= 0) supersub(form, lm + PPINDENT, 0, pfun);
  else supersub(form, lm + PPINDENT, 1, pfun);
}

const int ppspecials = 16;
const char ppspecial[ppspecials] PROGMEM = 
  { DOTIMES, DOLIST, IF, SETQ, TEE, LET, LETSTAR, LAMBDA, WHEN, UNLESS, WITHI2C, WITHSERIAL, WITHSPI, WITHSDCARD, FORMILLIS, WITHLCD };

void supersub (object *form, int lm, int super, pfun_t pfun) {
  int special = 0, separate = 1;
  object *arg = car(form);
  if (symbolp(arg)) {
    int name = arg->name;
    if (name == DEFUN) special = 2;
    else for (int i=0; i<ppspecials; i++) {
      if (name == pgm_read_byte(&ppspecial[i])) { special = 1; break; }    
    } 
  }
  while (form != NULL) {
    if (atom(form)) { pfstring(PSTR(" . "), pfun); printobject(form, pfun); pfun(')'); return; }
    else if (separate) { pfun('('); separate = 0; }
    else if (special) { pfun(' '); special--; }
    else if (!super) pfun(' ');
    else { pln(pfun); indent(lm, pfun); }
    superprint(car(form), lm, pfun);
    form = cdr(form);   
  }
  pfun(')'); return;
}

object *fn_pprint (object *args, object *env) {
  (void) env;
  object *obj = first(args);
  pfun_t pfun = pstreamfun(cdr(args));
  pln(pfun);
  superprint(obj, 0, pfun);
  return symbol(NOTHING);
}

object *fn_pprintall (object *args, object *env) {
  (void) args, (void) env;
  object *globals = GlobalEnv;
  while (globals != NULL) {
    object *pair = first(globals);
    object *var = car(pair);
    object *val = cdr(pair);
    if (consp(val) && symbolp(car(val)) && car(val)->name == LAMBDA) {
      pln(pserial);
      superprint(cons(symbol(DEFUN), cons(var, cdr(val))), 0, pserial);
      pln(pserial);
    }
    globals = cdr(globals);
  }
  return symbol(NOTHING);
}

// LispLibrary

object *fn_require (object *args, object *env) {
  object *arg = first(args);
  object *globals = GlobalEnv;
  if (!symbolp(arg)) error3(REQUIRE, PSTR("argument is not a symbol"));
  while (globals != NULL) {
    object *pair = first(globals);
    object *var = car(pair);
    if (symbolp(var) && var == arg) return nil;
    globals = cdr(globals);
  }
  GlobalStringIndex = 0;
  object *line = read(glibrary);
  while (line != NULL) {
    // Is this the definition we want
    int fname = first(line)->name;
    if ((fname == DEFUN || fname == DEFVAR) && symbolp(second(line)) && second(line)->name == arg->name) {
      eval(line, env);
      return tee;
    }
    line = read(glibrary);
  }
  return nil; 
}

object *fn_listlibrary (object *args, object *env) {
  (void) args, (void) env;
  GlobalStringIndex = 0;
  object *line = read(glibrary);
  while (line != NULL) {
    int fname = first(line)->name;
    if (fname == DEFUN || fname == DEFVAR) {
      pstring(name(second(line)), pserial); pserial(' ');
    }
    line = read(glibrary);
  }
  return symbol(NOTHING); 
}

// Insert your own function definitions here

// Built-in procedure names - stored in PROGMEM

const char string0[] PROGMEM = "nil";
const char string1[] PROGMEM = "t";
const char string2[] PROGMEM = "nothing";
const char string3[] PROGMEM = "&optional";
const char string4[] PROGMEM = "&rest";
const char string5[] PROGMEM = "lambda";
const char string6[] PROGMEM = "let";
const char string7[] PROGMEM = "let*";
const char string8[] PROGMEM = "closure";
const char string9[] PROGMEM = "special_forms";
const char string10[] PROGMEM = "quote";
const char string11[] PROGMEM = "defun";
const char string12[] PROGMEM = "defvar";
const char string13[] PROGMEM = "setq";
const char string14[] PROGMEM = "loop";
const char string15[] PROGMEM = "push";
const char string16[] PROGMEM = "pop";
const char string17[] PROGMEM = "incf";
const char string18[] PROGMEM = "decf";
const char string19[] PROGMEM = "setf";
const char string20[] PROGMEM = "dolist";
const char string21[] PROGMEM = "dotimes";
const char string22[] PROGMEM = "trace";
const char string23[] PROGMEM = "untrace";
const char string24[] PROGMEM = "for-millis";
const char string25[] PROGMEM = "with-serial";
const char string26[] PROGMEM = "with-i2c";
const char string27[] PROGMEM = "with-spi";
const char string28[] PROGMEM = "with-sd-card";
const char string29[] PROGMEM = "with-lcd";
const char string30[] PROGMEM = "tail_forms";
const char string31[] PROGMEM = "progn";
const char string32[] PROGMEM = "return";
const char string33[] PROGMEM = "if";
const char string34[] PROGMEM = "cond";
const char string35[] PROGMEM = "when";
const char string36[] PROGMEM = "unless";
const char string37[] PROGMEM = "case";
const char string38[] PROGMEM = "and";
const char string39[] PROGMEM = "or";
const char string40[] PROGMEM = "functions";
const char string41[] PROGMEM = "not";
const char string42[] PROGMEM = "null";
const char string43[] PROGMEM = "cons";
const char string44[] PROGMEM = "atom";
const char string45[] PROGMEM = "listp";
const char string46[] PROGMEM = "consp";
const char string47[] PROGMEM = "symbolp";
const char string48[] PROGMEM = "streamp";
const char string49[] PROGMEM = "eq";
const char string50[] PROGMEM = "car";
const char string51[] PROGMEM = "first";
const char string52[] PROGMEM = "cdr";
const char string53[] PROGMEM = "rest";
const char string54[] PROGMEM = "caar";
const char string55[] PROGMEM = "cadr";
const char string56[] PROGMEM = "second";
const char string57[] PROGMEM = "cdar";
const char string58[] PROGMEM = "cddr";
const char string59[] PROGMEM = "caaar";
const char string60[] PROGMEM = "caadr";
const char string61[] PROGMEM = "cadar";
const char string62[] PROGMEM = "caddr";
const char string63[] PROGMEM = "third";
const char string64[] PROGMEM = "cdaar";
const char string65[] PROGMEM = "cdadr";
const char string66[] PROGMEM = "cddar";
const char string67[] PROGMEM = "cdddr";
const char string68[] PROGMEM = "length";
const char string69[] PROGMEM = "list";
const char string70[] PROGMEM = "reverse";
const char string71[] PROGMEM = "nth";
const char string72[] PROGMEM = "assoc";
const char string73[] PROGMEM = "member";
const char string74[] PROGMEM = "apply";
const char string75[] PROGMEM = "funcall";
const char string76[] PROGMEM = "append";
const char string77[] PROGMEM = "mapc";
const char string78[] PROGMEM = "mapcar";
const char string79[] PROGMEM = "mapcan";
const char string80[] PROGMEM = "+";
const char string81[] PROGMEM = "-";
const char string82[] PROGMEM = "*";
const char string83[] PROGMEM = "/";
const char string84[] PROGMEM = "truncate";
const char string85[] PROGMEM = "mod";
const char string86[] PROGMEM = "1+";
const char string87[] PROGMEM = "1-";
const char string88[] PROGMEM = "abs";
const char string89[] PROGMEM = "random";
const char string90[] PROGMEM = "max";
const char string91[] PROGMEM = "min";
const char string92[] PROGMEM = "/=";
const char string93[] PROGMEM = "=";
const char string94[] PROGMEM = "<";
const char string95[] PROGMEM = "<=";
const char string96[] PROGMEM = ">";
const char string97[] PROGMEM = ">=";
const char string98[] PROGMEM = "plusp";
const char string99[] PROGMEM = "minusp";
const char string100[] PROGMEM = "zerop";
const char string101[] PROGMEM = "oddp";
const char string102[] PROGMEM = "evenp";
const char string103[] PROGMEM = "integerp";
const char string104[] PROGMEM = "numberp";
const char string105[] PROGMEM = "char";
const char string106[] PROGMEM = "char-code";
const char string107[] PROGMEM = "code-char";
const char string108[] PROGMEM = "characterp";
const char string109[] PROGMEM = "stringp";
const char string110[] PROGMEM = "string=";
const char string111[] PROGMEM = "string<";
const char string112[] PROGMEM = "string>";
const char string113[] PROGMEM = "sort";
const char string114[] PROGMEM = "string";
const char string115[] PROGMEM = "concatenate";
const char string116[] PROGMEM = "subseq";
const char string117[] PROGMEM = "read-from-string";
const char string118[] PROGMEM = "princ-to-string";
const char string119[] PROGMEM = "prin1-to-string";
const char string120[] PROGMEM = "logand";
const char string121[] PROGMEM = "logior";
const char string122[] PROGMEM = "logxor";
const char string123[] PROGMEM = "lognot";
const char string124[] PROGMEM = "ash";
const char string125[] PROGMEM = "logbitp";
const char string126[] PROGMEM = "eval";
const char string127[] PROGMEM = "globals";
const char string128[] PROGMEM = "locals";
const char string129[] PROGMEM = "makunbound";
const char string130[] PROGMEM = "break";
const char string131[] PROGMEM = "read";
const char string132[] PROGMEM = "prin1";
const char string133[] PROGMEM = "print";
const char string134[] PROGMEM = "princ";
const char string135[] PROGMEM = "terpri";
const char string136[] PROGMEM = "read-byte";
const char string137[] PROGMEM = "read-line";
const char string138[] PROGMEM = "write-byte";
const char string139[] PROGMEM = "write-string";
const char string140[] PROGMEM = "write-line";
const char string141[] PROGMEM = "restart-i2c";
const char string142[] PROGMEM = "gc";
const char string143[] PROGMEM = "room";
const char string144[] PROGMEM = "save-image";
const char string145[] PROGMEM = "load-image";
const char string146[] PROGMEM = "cls";
const char string147[] PROGMEM = "pinmode";
const char string148[] PROGMEM = "digitalread";
const char string149[] PROGMEM = "digitalwrite";
const char string150[] PROGMEM = "analogread";
const char string151[] PROGMEM = "analogwrite";
const char string152[] PROGMEM = "delay";
const char string153[] PROGMEM = "millis";
const char string154[] PROGMEM = "sleep";
const char string155[] PROGMEM = "note";
const char string156[] PROGMEM = "edit";
const char string157[] PROGMEM = "pprint";
const char string158[] PROGMEM = "pprintall";
const char string159[] PROGMEM = "require";
const char string160[] PROGMEM = "list-library";

