technoblogy/ulisp-msp430/ulisp-msp430.ino
const tbl_entry_t lookup_table[] PROGMEM = {
  { string0, NULL, 0, 0 },
  { string1, NULL, 0, 0 },
  { string2, NULL, 0, 0 },
  { string3, NULL, 0, 0 },
  { string4, NULL, 0, 0 },
  { string5, NULL, 0, 127 },
  { string6, NULL, 0, 127 },
  { string7, NULL, 0, 127 },
  { string8, NULL, 0, 127 },
  { string9, NULL, NIL, NIL },
  { string10, sp_quote, 1, 1 },
  { string11, sp_defun, 0, 127 },
  { string12, sp_defvar, 2, 2 },
  { string13, sp_setq, 2, 2 },
  { string14, sp_loop, 0, 127 },
  { string15, sp_push, 2, 2 },
  { string16, sp_pop, 1, 1 },
  { string17, sp_incf, 1, 2 },
  { string18, sp_decf, 1, 2 },
  { string19, sp_setf, 2, 2 },
  { string20, sp_dolist, 1, 127 },
  { string21, sp_dotimes, 1, 127 },
  { string22, sp_trace, 0, 1 },
  { string23, sp_untrace, 0, 1 },
  { string24, sp_formillis, 1, 127 },
  { string25, sp_withserial, 1, 127 },
  { string26, sp_withi2c, 1, 127 },
  { string27, sp_withspi, 1, 127 },
  { string28, sp_withsdcard, 2, 127 },
  { string29, sp_withlcd, 1, 127 },
  { string30, NULL, NIL, NIL },
  { string31, tf_progn, 0, 127 },
  { string32, tf_return, 0, 127 },
  { string33, tf_if, 2, 3 },
  { string34, tf_cond, 0, 127 },
  { string35, tf_when, 1, 127 },
  { string36, tf_unless, 1, 127 },
  { string37, tf_case, 1, 127 },
  { string38, tf_and, 0, 127 },
  { string39, tf_or, 0, 127 },
  { string40, NULL, NIL, NIL },
  { string41, fn_not, 1, 1 },
  { string42, fn_not, 1, 1 },
  { string43, fn_cons, 2, 2 },
  { string44, fn_atom, 1, 1 },
  { string45, fn_listp, 1, 1 },
  { string46, fn_consp, 1, 1 },
  { string47, fn_symbolp, 1, 1 },
  { string48, fn_streamp, 1, 1 },
  { string49, fn_eq, 2, 2 },
  { string50, fn_car, 1, 1 },
  { string51, fn_car, 1, 1 },
  { string52, fn_cdr, 1, 1 },
  { string53, fn_cdr, 1, 1 },
  { string54, fn_caar, 1, 1 },
  { string55, fn_cadr, 1, 1 },
  { string56, fn_cadr, 1, 1 },
  { string57, fn_cdar, 1, 1 },
  { string58, fn_cddr, 1, 1 },
  { string59, fn_caaar, 1, 1 },
  { string60, fn_caadr, 1, 1 },
  { string61, fn_cadar, 1, 1 },
  { string62, fn_caddr, 1, 1 },
  { string63, fn_caddr, 1, 1 },
  { string64, fn_cdaar, 1, 1 },
  { string65, fn_cdadr, 1, 1 },
  { string66, fn_cddar, 1, 1 },
  { string67, fn_cdddr, 1, 1 },
  { string68, fn_length, 1, 1 },
  { string69, fn_list, 0, 127 },
  { string70, fn_reverse, 1, 1 },
  { string71, fn_nth, 2, 2 },
  { string72, fn_assoc, 2, 2 },
  { string73, fn_member, 2, 2 },
  { string74, fn_apply, 2, 127 },
  { string75, fn_funcall, 1, 127 },
  { string76, fn_append, 0, 127 },
  { string77, fn_mapc, 2, 3 },
  { string78, fn_mapcar, 2, 3 },
  { string79, fn_mapcan, 2, 3 },
  { string80, fn_add, 0, 127 },
  { string81, fn_subtract, 1, 127 },
  { string82, fn_multiply, 0, 127 },
  { string83, fn_divide, 2, 127 },
  { string84, fn_divide, 1, 2 },
  { string85, fn_mod, 2, 2 },
  { string86, fn_oneplus, 1, 1 },
  { string87, fn_oneminus, 1, 1 },
  { string88, fn_abs, 1, 1 },
  { string89, fn_random, 1, 1 },
  { string90, fn_maxfn, 1, 127 },
  { string91, fn_minfn, 1, 127 },
  { string92, fn_noteq, 1, 127 },
  { string93, fn_numeq, 1, 127 },
  { string94, fn_less, 1, 127 },
  { string95, fn_lesseq, 1, 127 },
  { string96, fn_greater, 1, 127 },
  { string97, fn_greatereq, 1, 127 },
  { string98, fn_plusp, 1, 1 },
  { string99, fn_minusp, 1, 1 },
  { string100, fn_zerop, 1, 1 },
  { string101, fn_oddp, 1, 1 },
  { string102, fn_evenp, 1, 1 },
  { string103, fn_integerp, 1, 1 },
  { string104, fn_numberp, 1, 1 },
  { string105, fn_char, 2, 2 },
  { string106, fn_charcode, 1, 1 },
  { string107, fn_codechar, 1, 1 },
  { string108, fn_characterp, 1, 1 },
  { string109, fn_stringp, 1, 1 },
  { string110, fn_stringeq, 2, 2 },
  { string111, fn_stringless, 2, 2 },
  { string112, fn_stringgreater, 2, 2 },
  { string113, fn_sort, 2, 2 },
  { string114, fn_stringfn, 1, 1 },
  { string115, fn_concatenate, 1, 127 },
  { string116, fn_subseq, 2, 3 },
  { string117, fn_readfromstring, 1, 1 },
  { string118, fn_princtostring, 1, 1 },
  { string119, fn_prin1tostring, 1, 1 },
  { string120, fn_logand, 0, 127 },
  { string121, fn_logior, 0, 127 },
  { string122, fn_logxor, 0, 127 },
  { string123, fn_lognot, 1, 1 },
  { string124, fn_ash, 2, 2 },
  { string125, fn_logbitp, 2, 2 },
  { string126, fn_eval, 1, 1 },
  { string127, fn_globals, 0, 0 },
  { string128, fn_locals, 0, 0 },
  { string129, fn_makunbound, 1, 1 },
  { string130, fn_break, 0, 0 },
  { string131, fn_read, 0, 1 },
  { string132, fn_prin1, 1, 2 },
  { string133, fn_print, 1, 2 },
  { string134, fn_princ, 1, 2 },
  { string135, fn_terpri, 0, 1 },
  { string136, fn_readbyte, 0, 2 },
  { string137, fn_readline, 0, 1 },
  { string138, fn_writebyte, 1, 2 },
  { string139, fn_writestring, 1, 2 },
  { string140, fn_writeline, 1, 2 },
  { string141, fn_restarti2c, 1, 2 },
  { string142, fn_gc, 0, 0 },
  { string143, fn_room, 0, 0 },
  { string144, fn_saveimage, 0, 1 },
  { string145, fn_loadimage, 0, 1 },
  { string146, fn_cls, 0, 0 },
  { string147, fn_pinmode, 2, 2 },
  { string148, fn_digitalread, 1, 1 },
  { string149, fn_digitalwrite, 2, 2 },
  { string150, fn_analogread, 1, 1 },
  { string151, fn_analogwrite, 2, 2 },
  { string152, fn_delay, 1, 1 },
  { string153, fn_millis, 0, 0 },
  { string154, fn_sleep, 1, 1 },
  { string155, fn_note, 0, 3 },
  { string156, fn_edit, 1, 1 },
  { string157, fn_pprint, 1, 2 },
  { string158, fn_pprintall, 0, 0 },
  { string159, fn_require, 1, 1 },
  { string160, fn_listlibrary, 0, 0 },
};

// Table lookup functions

int builtin (char* n) {
  int entry = 0;
  while (entry < ENDFUNCTIONS) {
    if (strcasecmp_P(n, (char*)pgm_read_word(&lookup_table[entry].string)) == 0)
      return entry;
    entry++;
  }
  return ENDFUNCTIONS;
}

int longsymbol (char *buffer) {
  char *p = SymbolTable;
  int i = 0;
  while (strcasecmp(p, buffer) != 0) {p = p + strlen(p) + 1; i++; }
  if (p == buffer) {
    // Add to symbol table?
    char *newtop = SymbolTop + strlen(p) + 1;
    if (SYMBOLTABLESIZE - (newtop - SymbolTable) < BUFFERSIZE) error(PSTR("No room for long symbols"));
    SymbolTop = newtop;
  }
  if (i > 1535) error(PSTR("Too many long symbols"));
  return i + 64000; // First number unused by radix40
}

intptr_t lookupfn (symbol_t name) {
  return pgm_read_word(&lookup_table[name].fptr);
}

uint8_t lookupmin (symbol_t name) {
  return pgm_read_byte(&lookup_table[name].min);
}

uint8_t lookupmax (symbol_t name) {
  return pgm_read_byte(&lookup_table[name].max);
}

